#include<cstdlib>
#include<cstdio>
#include<iostream>
#include<cstring>
#include"code_waibibabu.h" 
using namespace std;
int main()
{
	char test1[]="‘⁄¥À ‰»Îƒ„“™º”√‹µƒƒ⁄»›";
	
	printf("%s\n",encode_wbbb(test1));
	
	char test2[]="Õ·±»Õ·±»∞Õ≤∑Õ·±»∞Õ≤∑Õ·±»∞Õ≤∑∞Õ≤∑Õ·±»Õ·±»∞Õ≤∑Õ·±»Õ·±»∞Õ≤∑Õ·±»∞Õ≤∑Õ·±»∞Õ≤∑Õ·±»Õ·±»∞Õ≤∑Õ·±»∞Õ≤∑∞Õ≤∑Õ·±»Õ·±»∞Õ≤∑∞Õ≤∑Õ·±»∞Õ≤∑Õ·±»Õ·±»Õ·±»Õ·±»∞Õ≤∑∞Õ≤∑Õ·±»∞Õ≤∑Õ·±»∞Õ≤∑Õ·±»Õ·±»Õ·±»∞Õ≤∑∞Õ≤∑Õ·±»∞Õ≤∑∞Õ≤∑Õ·±»Õ·±»∞Õ≤∑∞Õ≤∑Õ·±»∞Õ≤∑∞Õ≤∑∞Õ≤∑Õ·±»Õ·±»Õ·±»∞Õ≤∑Õ·±»∞Õ≤∑Õ·±»Õ·±»Õ·±»Õ·±»∞Õ≤∑∞Õ≤∑∞Õ≤∑Õ·±»∞Õ≤∑∞Õ≤∑Õ·±»Õ·±»Õ·±»∞Õ≤∑∞Õ≤∑∞Õ≤∑Õ·±»Õ·±»Õ·±»Õ·±»∞Õ≤∑Õ·±»∞Õ≤∑∞Õ≤∑Õ·±»∞Õ≤∑Õ·±»∞Õ≤∑Õ·±»∞Õ≤∑Õ·±»∞Õ≤∑Õ·±»∞Õ≤∑Õ·±»∞Õ≤∑Õ·±»Õ·±»Õ·±»Õ·±»∞Õ≤∑Õ·±»Õ·±»Õ·±»Õ·±»∞Õ≤∑∞Õ≤∑∞Õ≤∑Õ·±»∞Õ≤∑Õ·±»Õ·±»∞Õ≤∑∞Õ≤∑∞Õ≤∑∞Õ≤∑Õ·±»Õ·±»Õ·±»Õ·±»∞Õ≤∑Õ·±»Õ·±»Õ·±»∞Õ≤∑∞Õ≤∑Õ·±»∞Õ≤∑Õ·±»Õ·±»∞Õ≤∑Õ·±»∞Õ≤∑Õ·±»Õ·±»Õ·±»∞Õ≤∑∞Õ≤∑∞Õ≤∑Õ·±»∞Õ≤∑∞Õ≤∑Õ·±»Õ·±»∞Õ≤∑∞Õ≤∑∞Õ≤∑Õ·±»∞Õ≤∑∞Õ≤∑Õ·±»Õ·±»∞Õ≤∑Õ·±»Õ·±»∞Õ≤∑Õ·±»∞Õ≤∑Õ·±»Õ·±»∞Õ≤∑∞Õ≤∑Õ·±»∞Õ≤∑∞Õ≤∑∞Õ≤∑Õ·±»Õ·±»∞Õ≤∑Õ·±»Õ·±»Õ·±»∞Õ≤∑Õ·±»";
	
	printf("%s\n",decode_wbbb(test2));
	return 0;
} 
